In [1]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col='번호')
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

- 주소 컬럼에 '시' 추가 ( 광주 => 광주시 )

In [2]:
df['주소'] = df['주소']+'시'

In [3]:
df

     이름   주소  나이   점수      언어
번호
1번  김길동  광주시  33   76  Python
2번  이길동  서울시  23   88    Java
3번  강길동  대구시  30   98     C++
4번  홍길동  대전시  20  100     NaN
5번  박길동  광주시  21   60     NaN
6번  나길동  서울시  25   90       C

- 점수 컬럼에 '점' 추가

In [4]:
df['점수'] = df['점수'] + '점'

UFuncTypeError: ufunc 'add' did not contain a loop with signature matching types (dtype('int64'), dtype('<U1')) -> None

In [7]:
5 + 10

15

In [8]:
5 + 'a'

TypeError: unsupported operand type(s) for +: 'int' and 'str'

In [5]:
def add_jum(jum):
    return str(jum) + '점'

df['점수'] = df['점수'].apply(add_jum)
df

     이름   주소  나이    점수      언어
번호
1번  김길동  광주시  33   76점  Python
2번  이길동  서울시  23   88점    Java
3번  강길동  대구시  30   98점     C++
4번  홍길동  대전시  20  100점     NaN
5번  박길동  광주시  21   60점     NaN
6번  나길동  서울시  25   90점       C

In [10]:
df = pd.read_excel('score.xlsx', index_col='번호')

In [11]:
df['점수'] = df['점수'].apply(lambda x: str(x) + '점')
df

     이름  주소  나이    점수      언어
번호
1번  김길동  광주  33   76점  Python
2번  이길동  서울  23   88점    Java
3번  강길동  대구  30   98점     C++
4번  홍길동  대전  20  100점     NaN
5번  박길동  광주  21   60점     NaN
6번  나길동  서울  25   90점       C

In [12]:
df['언어'] = df['언어'].str.upper()
df

     이름  주소  나이    점수      언어
번호
1번  김길동  광주  33   76점  PYTHON
2번  이길동  서울  23   88점    JAVA
3번  강길동  대구  30   98점     C++
4번  홍길동  대전  20  100점     NaN
5번  박길동  광주  21   60점     NaN
6번  나길동  서울  25   90점       C

In [15]:
def cap(lang):
    if pd.notnull(lang):
        return lang.capitalize()
df['언어'] = df['언어'].apply(cap)
df

     이름  주소  나이    점수      언어
번호
1번  김길동  광주  33   76점  Python
2번  이길동  서울  23   88점    Java
3번  강길동  대구  30   98점     C++
4번  홍길동  대전  20  100점    None
5번  박길동  광주  21   60점    None
6번  나길동  서울  25   90점       C

In [16]:
df = pd.read_excel('score.xlsx', index_col='번호')

In [3]:
df['언어'] = df['언어'].str.capitalize()

In [4]:
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C